Revit 2024 API
RebarFreeFormValidationResult Enumeration
 Errors for the Free Form Rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum RebarFreeFormValidationResult
Visual Basic
Public Enumeration RebarFreeFormValidationResult
Visual C++
public enum class RebarFreeFormValidationResult
Members
Member name | Description
Success |  Operation was done with success.
Undefined |  An unexpected error occured.
NullCurve |  One or more of the input curves was null.
UnboundCurve |  One or more of the input curves was unbounded.
InvalidLoop |  Curves doesn't form a valid curve loop.
RebarCantBeBent |  A rebar constructed from curves can't be bent according to the bending radius.
See Also
Autodesk.Revit.DB.Structure Namespace